Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
/*  ============================================================
    DUAL-MODE OBSTACLE-AVOIDING + RC WEB CAR
    ESP32  |  TB6612 x2  |  Servo  |  HC-SR04  |  IR  |  Buzzer
    ============================================================
    MODE A  –  Obstacle Avoidance (autonomous, slow speed)
    MODE B  –  RC Web Control     (WiFi browser joystick, fast)
    How to switch modes
    -------------------
    1. Connect to the ESP32's WiFi AP ("GhostDrive") or router
    2. Open http://<IP>/ in your phone or computer browser
    3. Enjoy the premium futuristic Glassmorphism Control Panel!
    ============================================================ */
#include <Arduino.h>
#include <ESP32Servo.h>
#include <WiFi.h>
#include <WebServer.h>
#include <WebSocketsServer.h>
#include <Adafruit_NeoPixel.h>
#include <ESPmDNS.h>

#define NEOPIXEL_PIN 2
#define NUM_LEDS     4
Adafruit_NeoPixel strip(NUM_LEDS, NEOPIXEL_PIN, NEO_GRB + NEO_KHZ800);
int carMotionState = 0;   // 0=STOP, 1=FWD, 2=REV, 3=L_PIVOT, 4=R_PIVOT, 5=F_LEFT, 6=F_RIGHT, 7=B_LEFT, 8=B_RIGHT
int webHeadlightMode = 1; // 0=Off, 1=Low, 2=High
bool webHazardsOn = false;
bool webParkingOn = false;

// ─── WiFi Configuration ──────────────────────────────────────
#define WIFI_AP_MODE false // Connect to phone hotspot
const char* WIFI_SSID = "22";
const char* WIFI_PASS = "12345678";
const char* FALLBACK_SSID = "GhostDrive_AP";
const char* FALLBACK_PASS = "12345678";
WebServer server(80);
WebSocketsServer webSocket = WebSocketsServer(81);
// ─── Mode ────────────────────────────────────────────────────
enum CarMode { MODE_OA, MODE_RC, MODE_GESTURE, MODE_FOLLOW };
CarMode carMode = MODE_OA;   // default: OA on boot
// ─── Pin Mapping ─────────────────────────────────────────────
// Left TB6612 (two motors on left side)
const int L_AIN1 = 16, L_AIN2 = 17, L_PWMA = 14;
const int L_BIN1 = 19, L_BIN2 = 21, L_PWMB = 22;
// Right TB6612 (two motors on right side)
const int R_AIN1 = 23, R_AIN2 = 25, R_PWMA = 26;
const int R_BIN1 = 32, R_BIN2 = 33, R_PWMB = 13;
const int STBY_PIN   = 27;
const int SERVO_PIN  =  4;
const int TRIG_PIN   =  5;
const int ECHO_PIN   = 18;   // level-shift to 3.3 V!
const int IR_PIN     = 34;   // analog input-only
const int BUZZER     = 15;
// ─── Motor PWM (LEDC Channels) ───────────────────────────────
const int PWM_FREQ     = 18000; // quiet high frequency
const int PWM_RES_BITS = 10;    // 0..1023
const int PWM_MAX      = (1 << PWM_RES_BITS) - 1;
// Core v2.x Channel numbers (Ignored on Core v3.x)
const int CH_L_PWMA = 0;
const int CH_L_PWMB = 1;
const int CH_R_PWMA = 2;
const int CH_R_PWMB = 3;
// ─── Per-motor inversion ──────────────────────────────────────
bool L_A_INVERT = true;
bool L_B_INVERT = false;
bool R_A_INVERT = true;
bool R_B_INVERT = false;
// ─── Speed constants ──────────────────────────────────────────
const int OA_SPEED      = 380;   // OA forward (0-1023) - Reduced for safety
const int OA_TURN       = 280;   // OA pivot - Reduced for safety
const int OA_REVERSE    = 320;   // OA reverse - Reduced for safety
const int RC_SPEED_DEF  = 800;   // RC default speed (faster)
const int RC_TURN_DEF   = 650;   // RC default pivot
// RC runtime speed (changed by slider)
int rcSpeed = RC_SPEED_DEF;
// ─── OA Behaviour ─────────────────────────────────────────────
const int SAFE_DIST_CM  = 30;
const int CLEAR_DIST_CM = 18;
const int TURN_ANGLE_L  = 150;
const int TURN_ANGLE_C  =  90;
const int TURN_ANGLE_R  =  30;
const int REVERSE_MS    = 300;
const int PIVOT_MS      = 260;
const int IR_THRESHOLD  = 1600;
// ─── RC state ────────────────────────────────────────────────
int  rcServoAngle = 90;
bool rcHornOn     = false;
char rcCmd[4]     = "S";  // Drive command: F, B, L, R, FL, FR, BL, BR, S
// ─── Telemetry Globals ────────────────────────────────────────
volatile long lastDistance = 999;
volatile int lastIR = 4095;
int currentServoAngle = 90;
volatile long dL_dist = 999;
volatile long dC_dist = 999;
volatile long dR_dist = 999;
// ─── Actuator Globals ─────────────────────────────────────────
Servo scanServo;
// ─── Human Follower state ────────────────────────────────────
int followAngle = 90;
bool followFound = false;
int followSweepDir = 8;
unsigned long lastFollowTime = 0;
unsigned long lostFollowTime = 0;
// ─────────────────────────────────────────────────────────────
//  MOTOR DRIVER HELPERS (Compatible with Core v2.x and v3.x)
// ─────────────────────────────────────────────────────────────
void writeChannel(bool forward, int AIN1, int AIN2, int pwmPin, int pwmCh, int pwmVal, bool invert) {
  bool f = invert ? !forward : forward;
  digitalWrite(AIN1, f ? HIGH : LOW);
  digitalWrite(AIN2, f ? LOW  : HIGH);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(pwmPin, pwmVal);
#else
  ledcWrite(pwmCh, pwmVal);
#endif
}
void setSide(int speed,
             int AIN1_A, int AIN2_A, int PWM_A_pin, int PWM_A_ch, bool INV_A,
             int AIN1_B, int AIN2_B, int PWM_B_pin, int PWM_B_ch, bool INV_B) {
  int mag = abs(speed);
  if (mag > PWM_MAX) mag = PWM_MAX;
  bool fwd = (speed >= 0);
  writeChannel(fwd, AIN1_A, AIN2_A, PWM_A_pin, PWM_A_ch, mag, INV_A);
  writeChannel(fwd, AIN1_B, AIN2_B, PWM_B_pin, PWM_B_ch, mag, INV_B);
}
void driveLeft (int s){ setSide(s, L_AIN1, L_AIN2, L_PWMA, CH_L_PWMA, L_A_INVERT, L_BIN1, L_BIN2, L_PWMB, CH_L_PWMB, L_B_INVERT); }
void driveRight(int s){ setSide(s, R_AIN1, R_AIN2, R_PWMA, CH_R_PWMA, R_A_INVERT, R_BIN1, R_BIN2, R_PWMB, CH_R_PWMB, R_B_INVERT); }
void stopAll() {
  carMotionState = 0;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(L_PWMA, 0); ledcWrite(L_PWMB, 0);
  ledcWrite(R_PWMA, 0); ledcWrite(R_PWMB, 0);
#else
  ledcWrite(CH_L_PWMA, 0); ledcWrite(CH_L_PWMB, 0);
  ledcWrite(CH_R_PWMA, 0); ledcWrite(CH_R_PWMB, 0);
#endif
}
void forward   (int s){ carMotionState = 1; driveLeft(+s); driveRight(+s); }
void reverse   (int s){ carMotionState = 2; driveLeft(-s); driveRight(-s); }
void pivotLeft (int s){ carMotionState = 3; driveLeft(-s); driveRight(+s); }
void pivotRight(int s){ carMotionState = 4; driveLeft(+s); driveRight(-s); }

// NeoPixel state machine update function (Realistic Automotive Simulation)
void updateLEDs() {
  static unsigned long lastBlinkTime = 0;
  static bool blinkState = false;
  static unsigned long lastMoveTime = 0;
  static int lastMotionState = 0;
  unsigned long now = millis();
  
  if (now - lastBlinkTime > 350) { // Standard car blinker speed (85 blinks/min)
    lastBlinkTime = now;
    blinkState = !blinkState;
  }

  // Track the transition from moving to stopped to detect braking
  if (carMotionState != lastMotionState) {
    if (lastMotionState != 0 && carMotionState == 0) {
      lastMoveTime = now; // Car just stopped, start brake light timer
    }
    lastMotionState = carMotionState;
  }

