Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  // 1. Establish default states for Headlights (FR, FL)
  uint32_t colorFR = strip.Color(0, 0, 0);
  uint32_t colorFL = strip.Color(0, 0, 0);

  if (webHeadlightMode == 1) {
    colorFR = strip.Color(70, 70, 70);      // Low Beam (dim white)
    colorFL = strip.Color(70, 70, 70);
  } else if (webHeadlightMode == 2) {
    colorFR = strip.Color(255, 255, 255);  // High Beam (bright white)
    colorFL = strip.Color(255, 255, 255);
  }

  // 2. Establish default states for Tail/Brake/Reverse Lights (BL, BR)
  uint32_t colorBL = strip.Color(0, 0, 0);
  uint32_t colorBR = strip.Color(0, 0, 0);

  // Determine if running lights are active (tail lights dim red if headlights are on)
  bool runningLightsOn = (webHeadlightMode > 0);
  if (runningLightsOn) {
    colorBL = strip.Color(15, 0, 0);  // Very low Red tail lights
    colorBR = strip.Color(15, 0, 0);
  }

  // Active braking logic:
  // Turn on bright red brake lights for 2.0 seconds after stopping from movement
  bool isBraking = (carMotionState == 0 && (now - lastMoveTime < 2000) && lastMoveTime > 0);

  if (isBraking) {
    colorBL = strip.Color(255, 0, 0);  // Bright Red Brake lights
    colorBR = strip.Color(255, 0, 0);
  } else if (carMotionState == 0) {
    // Stays idle: turn off tail lights entirely
    colorBL = strip.Color(0, 0, 0);
    colorBR = strip.Color(0, 0, 0);
  }

  // Reversing logic (taking back) - gets RED rather than white
  // Reversing states: 2 (REV), 7 (REV_LEFT), 8 (REV_RIGHT)
  if (carMotionState == 2 || carMotionState == 7 || carMotionState == 8) {
    colorBL = strip.Color(255, 0, 0);
    colorBR = strip.Color(255, 0, 0);
  }

  // 3. Apply Parking Mode Override
  // Parking mode is active when parked (carMotionState == 0) and webParkingOn is true
  if (webParkingOn && carMotionState == 0) {
    // Front parking lights are soft amber if headlights are OFF
    if (webHeadlightMode == 0) {
      colorFR = strip.Color(80, 30, 0);   // Soft Amber
      colorFL = strip.Color(80, 30, 0);
    }
    // Tail lights are soft red (overriding the bright red brakes)
    colorBL = strip.Color(30, 0, 0);      // Soft Red Tail light
    colorBR = strip.Color(30, 0, 0);
  }

  // 4. Blinker / Hazard Overrides (Amber/Orange-Yellow = 255, 140, 0)
  uint32_t colorAmber = strip.Color(255, 140, 0);

  // Check if hazards are on
  if (webHazardsOn) {
    if (blinkState) {
      colorFR = colorAmber;
      colorFL = colorAmber;
      colorBL = colorAmber;
      colorBR = colorAmber;
    }
  } else {
    // Left Blinker (states: 3 = pivot left, 5 = forward left, 7 = reverse left)
    bool leftBlinkerActive = (carMotionState == 3 || carMotionState == 5 || carMotionState == 7);
    if (leftBlinkerActive && blinkState) {
      colorFL = colorAmber;
      colorBL = colorAmber;
    }

    // Right Blinker (states: 4 = pivot right, 6 = forward right, 8 = reverse right)
    bool rightBlinkerActive = (carMotionState == 4 || carMotionState == 6 || carMotionState == 8);
    if (rightBlinkerActive && blinkState) {
      colorFR = colorAmber;
      colorBR = colorAmber;
    }
  }

  // Write to strip
  strip.setPixelColor(0, colorFR); // Index 0 = Front Right (FR)
  strip.setPixelColor(1, colorFL); // Index 1 = Front Left (FL)
  strip.setPixelColor(2, colorBL); // Index 2 = Back Left (BL)
  strip.setPixelColor(3, colorBR); // Index 3 = Back Right (BR)
  strip.show();
}

// Non-blocking delay function that keeps serving clients and updating LEDs
void delayAndUpdateLEDs(int ms) {
  unsigned long start = millis();
  while (millis() - start < (unsigned long)ms) {
    server.handleClient();
    webSocket.loop();
    updateLEDs();
    delay(1);
  }
}
// ─────────────────────────────────────────────────────────────
//  SENSOR / ACTUATOR HELPERS
// ─────────────────────────────────────────────────────────────
void beep(int ms) {
  digitalWrite(BUZZER, HIGH);
  delayAndUpdateLEDs(ms);
  digitalWrite(BUZZER, LOW);
}
long singlePingCM(unsigned long timeout_us = 20000UL) {
  digitalWrite(TRIG_PIN, LOW);  delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH); delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);
  unsigned long dur = pulseIn(ECHO_PIN, HIGH, timeout_us);
  return dur == 0 ? 9999 : dur / 58;
}
long distanceCM() {
  const int N = 5;
  long d[N];
  for (int i = 0; i < N; i++) { d[i] = singlePingCM(); delay(8); }
  for (int i = 0; i < N-1; i++)
    for (int j = i+1; j < N; j++)
      if (d[j] < d[i]) { long t = d[i]; d[i] = d[j]; d[j] = t; }
  return d[N/2];
}
void aimServo(int angle, bool wait = true) {
  if (angle != currentServoAngle) {
    scanServo.write(angle);
    currentServoAngle = angle;
    if (wait) {
      delayAndUpdateLEDs(150); // non-blocking wait to avoid freeze during sweep
    }
  }
}
int chooseBestTurn() {
  aimServo(TURN_ANGLE_L, true); dL_dist = distanceCM();
  aimServo(TURN_ANGLE_R, true); dR_dist = distanceCM();
  aimServo(TURN_ANGLE_C, true); dC_dist = distanceCM();
  return (dL_dist >= dR_dist) ? +1 : -1;
}
void applyRcCmd(const char* cmd, int spd) {
  int t = spd * 75 / 100; // soft turn speed coefficient
  if      (strcmp(cmd, "F")  == 0) { forward(spd); }
  else if (strcmp(cmd, "B")  == 0) { reverse(spd); }
  else if (strcmp(cmd, "L")  == 0) { pivotLeft(t); }
  else if (strcmp(cmd, "R")  == 0) { pivotRight(t); }
  else if (strcmp(cmd, "FL") == 0) { carMotionState = 5; driveLeft(spd); driveRight(t); }
  else if (strcmp(cmd, "FR") == 0) { carMotionState = 6; driveLeft(t);   driveRight(spd); }
  else if (strcmp(cmd, "BL") == 0) { carMotionState = 7; driveLeft(-t);  driveRight(-spd); }
  else if (strcmp(cmd, "BR") == 0) { carMotionState = 8; driveLeft(-spd);driveRight(-t); }
  else                             { stopAll(); }
}
void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
  switch(type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\n", num);
      break;
    case WStype_CONNECTED: {
      IPAddress ip = webSocket.remoteIP(num);
      Serial.printf("[%u] Connected from %s\n", num, ip.toString().c_str());
      break;
    }
    case WStype_TEXT: {
      String msg = String((char*)payload);
      if (msg.startsWith("g:")) {
        int colon1 = msg.indexOf(':', 2);
        if (colon1 != -1) {
          String cmd = msg.substring(2, colon1);
          int speed = msg.substring(colon1 + 1).toInt();
          if (carMode == MODE_GESTURE) {
            applyRcCmd(cmd.c_str(), speed);
          }
        }
      } else if (msg.startsWith("cmd:")) {
        String cmd = msg.substring(4);
        if (carMode == MODE_RC) {
          strlcpy(rcCmd, cmd.c_str(), sizeof(rcCmd));
        }
      } else if (msg.startsWith("speed:")) {
        int pct = msg.substring(6).toInt();
        pct = constrain(pct, 10, 100);
        rcSpeed = (int)(RC_SPEED_DEF * pct / 100);
      } else if (msg.startsWith("servo:")) {
        rcServoAngle = constrain(msg.substring(6).toInt(), 0, 180);
      } else if (msg.startsWith("horn:")) {
        rcHornOn = (msg.substring(5) == "1");
      } else if (msg.startsWith("led:h:")) {
        webHeadlightMode = msg.substring(6).toInt();
      } else if (msg.startsWith("led:hz:")) {
        webHazardsOn = (msg.substring(7) == "1");
      } else if (msg.startsWith("led:pk:")) {
        webParkingOn = (msg.substring(7) == "1");
      } else if (msg.startsWith("mode:")) {
        String m = msg.substring(5);
        stopAll();
        strlcpy(rcCmd, "S", sizeof(rcCmd));
        if (m == "rc") {
          carMode = MODE_RC;
          beep(80);
        } else if (m == "gesture") {
          carMode = MODE_GESTURE;
          beep(80);
        } else if (m == "follow") {
          carMode = MODE_FOLLOW;
          beep(80);
        } else {
          carMode = MODE_OA;
          beep(80); delay(80); beep(80);
          rcServoAngle = TURN_ANGLE_C;
        }
      }
      break;
    }
    default:
      break;
  }
}
void handleRoot() {
  String page = R"rawhtml(
<!DOCTYPE html>
<html>
<head>
  <meta charset='UTF-8'>
  <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'>
  <title>GHOST DRIVE // SCANNER DECK</title>
  <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@400;600;700;800&family=JetBrains+Mono:wght@700&display=swap" rel="stylesheet">
  <style>
    :root {
      --bg-color: #06070d;
      --card-bg: rgba(16, 18, 35, 0.55);
      --card-border: rgba(255, 255, 255, 0.05);
      --accent-primary: #6366f1; /* Indigo for RC */
      --accent-primary-glow: rgba(99, 102, 241, 0.25);
      --accent-success: #10b981; /* Emerald for Autopilot */
      --accent-success-glow: rgba(16, 185, 129, 0.25);
      --accent-gesture: #06b6d4; /* Cyan for Gesture Control */
      --accent-gesture-glow: rgba(6, 182, 212, 0.25);
      --accent-follow: #a855f7; /* Purple for Human Following */
      --accent-follow-glow: rgba(168, 85, 247, 0.25);
      --accent-danger: #f43f5e; /* Rose for Alerts/Horn */
      --accent-danger-glow: rgba(244, 63, 94, 0.3);
      --text-main: #f9fafb;
      --text-muted: #6b7280;
      
      /* Dynamic theme targets */
      --accent-active: var(--accent-success);
      --accent-active-glow: var(--accent-success-glow);
    }
    
    * {
      box-sizing: border-box;
      margin: 0;
      padding: 0;
      -webkit-tap-highlight-color: transparent;
      user-select: none;
    }
    
    body {
      font-family: 'Outfit', sans-serif;
      background-color: var(--bg-color);
      color: var(--text-main);
      background-image: 
      	radial-gradient(circle at 10% 20%, rgba(99, 102, 241, 0.12) 0%, transparent 40%),
      	radial-gradient(circle at 90% 80%, rgba(16, 185, 129, 0.08) 0%, transparent 40%);
      background-attachment: fixed;
      min-height: 100vh;
      display: flex;
      flex-direction: column;
      align-items: center;
      padding: 16px;
      overflow-x: hidden;
    }
    .app-container {
      width: 100%;
      max-width: 440px;
      display: flex;
      flex-direction: column;
      gap: 16px;
    }
    /* Active theme modifiers */
    .app-container.theme-oa {
      --accent-active: var(--accent-success);
      --accent-active-glow: var(--accent-success-glow);
    }
    .app-container.theme-rc {
      --accent-active: var(--accent-primary);
      --accent-active-glow: var(--accent-primary-glow);
    }
    .app-container.theme-gesture {
      --accent-active: var(--accent-gesture);
      --accent-active-glow: var(--accent-gesture-glow);
    }
    .app-container.theme-follow {
      --accent-active: var(--accent-follow);
      --accent-active-glow: var(--accent-follow-glow);
    }
    /* Car Light Visualizer styling */
    .car-visualizer {
      position: relative;
      width: 110px;
      height: 160px;
      margin: 16px auto;
      border: 2px solid rgba(255, 255, 255, 0.08);
      border-radius: 20px;
      background: rgba(16, 18, 35, 0.45);
      box-shadow: inset 0 0 15px rgba(255, 255, 255, 0.02);
      transition: all 0.3s ease;
    }
    .car-cabin {
      position: absolute;
      top: 45px;
      left: 18px;
      width: 70px;
      height: 60px;
      border: 1.5px solid rgba(255, 255, 255, 0.07);
      border-radius: 12px 12px 16px 16px;
      background: rgba(255, 255, 255, 0.03);
    }
    .v-led {
      position: absolute;
      width: 10px;
      height: 10px;
      border-radius: 50%;
      background: #111322;
      border: 1px solid rgba(255, 255, 255, 0.1);
      transition: all 0.15s ease;
    }
    .v-led.fl { top: 6px; left: 12px; }
    .v-led.fr { top: 6px; right: 12px; }
    .v-led.bl { bottom: 6px; left: 12px; }
    .v-led.br { bottom: 6px; right: 12px; }
    
    /* Headlight States */
    .v-led.hl-low {
      background: #e2e8f0;
      box-shadow: 0 0 8px rgba(226, 232, 240, 0.8), 0 -4px 12px rgba(226, 232, 240, 0.3);
    }
    .v-led.hl-high {
      background: #ffffff;
      box-shadow: 0 0 15px rgba(255, 255, 255, 1), 0 -8px 20px rgba(255, 255, 255, 0.5);
    }
    
    /* Tail/Brake States */
    .v-led.tail-dim {
      background: #ef4444;
      box-shadow: 0 0 6px rgba(239, 68, 68, 0.5);
    }
    .v-led.tail-brake {
      background: #ff0000;
      box-shadow: 0 0 15px rgba(255, 0, 0, 1), 0 4px 12px rgba(255, 0, 0, 0.4);
    }
    .v-led.tail-reverse {
      background: #ffffff;
      box-shadow: 0 0 12px rgba(255, 255, 255, 0.8), 0 4px 8px rgba(255, 255, 255, 0.3);
    }
    
