Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
      const vGauge = document.getElementById('vector-gauge');
      if (cmd === 'S') {
        vGauge.style.width = '20%';
        vGauge.style.background = 'var(--text-muted)';
      } else {
        vGauge.style.width = '100%';
        vGauge.style.background = 'var(--accent-active)';
      }
    }
  };
  
  const sendGestureCmd = (cmd, speed) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('g:' + cmd + ':' + speed);
    }
  };
  
  // RC Transmitter Button State Tracking
  // Supports simultaneous presses: FWD+LEFT = FL, FWD+RIGHT = FR, etc.
  const rcState = { fwd: false, rev: false, left: false, right: false };
  
  const calcRcCmd = () => {
    if (rcState.fwd  && rcState.left)  return 'FL';
    if (rcState.fwd  && rcState.right) return 'FR';
    if (rcState.rev  && rcState.left)  return 'BL';
    if (rcState.rev  && rcState.right) return 'BR';
    if (rcState.fwd)   return 'F';
    if (rcState.rev)   return 'B';
    if (rcState.left)  return 'L';
    if (rcState.right) return 'R';
    return 'S';
  };
  
  const attachRcBtn = (id, key) => {
    const btn = document.getElementById(id);
    if (!btn) return;
    btn.addEventListener('pointerdown', (e) => {
      e.preventDefault();
      btn.setPointerCapture(e.pointerId);
      rcState[key] = true;
      btn.classList.add('pressed');
      sendCmd(calcRcCmd());
    });
    const release = () => {
      rcState[key] = false;
      btn.classList.remove('pressed');
      sendCmd(calcRcCmd());
    };
    btn.addEventListener('pointerup', release);
    btn.addEventListener('pointerleave', release);
    btn.addEventListener('pointercancel', release);
  };
  
  attachRcBtn('rc-fwd',   'fwd');
  attachRcBtn('rc-rev',   'rev');
  attachRcBtn('rc-left',  'left');
  attachRcBtn('rc-right', 'right');
  
  const rcStopBtn = document.getElementById('rc-stop');
  if (rcStopBtn) {
    rcStopBtn.addEventListener('pointerdown', (e) => {
      e.preventDefault();
      Object.keys(rcState).forEach(k => rcState[k] = false);
      sendCmd('S');
    });
  }
  
  // Horn Button Touch/Pointer listeners
  const horn = document.getElementById('btn-horn');
  const hornStart = (e) => {
    e.preventDefault();
    horn.classList.add('active');
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('horn:1');
    } else {
      fetch('/horn?on=1').catch(() => {});
    }
  };
  
  const hornEnd = (e) => {
    e.preventDefault();
    horn.classList.remove('active');
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('horn:0');
    } else {
      fetch('/horn?on=0').catch(() => {});
    }
  };
  
  horn.addEventListener('pointerdown', hornStart);
  horn.addEventListener('pointerup', hornEnd);
  horn.addEventListener('pointerleave', hornEnd);
  
  // Sliders Input Bindings
  const speedSlider = document.getElementById('slide-speed');
  const speedVal = document.getElementById('val-speed');
  speedSlider.addEventListener('input', () => {
    const txt = speedSlider.value + '%';
    speedVal.textContent = txt;
    sendSpeed(speedSlider.value);
  });
  
  speedSlider.addEventListener('change', () => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('speed:' + speedSlider.value);
    } else {
      fetch('/speed?v=' + speedSlider.value).catch(() => {});
    }
  });
  
  const servoSlider = document.getElementById('slide-servo');
  const servoVal = document.getElementById('val-servo');
  servoSlider.addEventListener('input', () => {
    const txt = servoSlider.value + '°';
    servoVal.textContent = txt;
    sendServo(servoSlider.value);
  });
  
  const servoSliderChange = () => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('servo:' + servoSlider.value);
    } else {
      fetch('/servo?a=' + servoSlider.value).catch(() => {});
    }
  };
  servoSlider.addEventListener('change', servoSliderChange);
  
  // Mode Selection Tabs Switcher
  const changeMode = (mode) => {
    if (mode !== 'gesture' && imuActive) {
      stopOrientationListener();
    }
    syncModeTab(mode);
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('mode:' + mode);
    } else {
      fetch('/set?mode=' + mode).catch(() => {});
    }
  };
  
  const syncModeTab = (mode) => {
    const container = document.querySelector('.app-container');
    const selector = document.querySelector('.mode-selector');
    const tabs = ['oa', 'rc', 'gesture', 'follow'];
    
    tabs.forEach(t => {
      document.getElementById('tab-' + t).classList.remove('active');
      document.getElementById('panel-' + t).classList.remove('active');
    });
    
    document.getElementById('tab-' + mode).classList.add('active');
    document.getElementById('panel-' + mode).classList.add('active');
    
    selector.className = 'mode-selector';
    if (mode === 'rc') {
      selector.classList.add('rc-active');
      container.className = 'app-container theme-rc';
    } else if (mode === 'gesture') {
      selector.classList.add('gesture-active');
      container.className = 'app-container theme-gesture';
      drawImuIndicator(0, 0);
    } else if (mode === 'follow') {
      selector.classList.add('follow-active');
      container.className = 'app-container theme-follow';
    } else {
      container.className = 'app-container theme-oa';
    }
  };
  
  // Telemetry updates
  const updateTelemetryUI = (data) => {
    window._lastTelemetry = data;
    // Distance Lidar
    const distVal = document.getElementById('val-dist');
    const distBar = document.getElementById('dist-gauge');
    if (data.dist >= 999) {
      distVal.textContent = 'CLEAR';
      distVal.className = 'metric-value status-safe';
      distBar.style.width = '100%';
      distBar.style.background = 'var(--accent-success)';
    } else {
      distVal.textContent = data.dist + ' cm';
      const pct = Math.min(Math.max(data.dist, 0), 100);
      distBar.style.width = pct + '%';
      if (data.dist > 50) {
        distVal.className = 'metric-value status-safe';
        distBar.style.background = 'var(--accent-success)';
      } else if (data.dist > 30) {
        distVal.className = 'metric-value status-warning';
        distBar.style.background = '#f59e0b';
      } else {
        distVal.className = 'metric-value status-danger';
        distBar.style.background = 'var(--accent-danger)';
      }
    }
    
