Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  window.toggleParking = () => {
    parkingActive = !parkingActive;
    const btn = document.getElementById('btn-parking');
    if (parkingActive) {
      btn.classList.add('active');
      btn.style.color = '#10b981';
      btn.style.borderColor = '#10b981';
    } else {
      btn.classList.remove('active');
      btn.style.color = 'var(--text-muted)';
      btn.style.borderColor = 'rgba(255,255,255,0.08)';
    }
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('led:pk:' + (parkingActive ? '1' : '0'));
    }
  };

  // Initialize Websocket connection
  initWebSocket();

  // Start the active telemetry radar sweep loop
  renderRadar();
  
  // Fallback HTTP status polling loop (if WebSocket is down)
  setInterval(() => {
    if (!socket || socket.readyState !== WebSocket.OPEN) {
      fetchTelemetry();
    }
  }, 400);

  // Live Top-Down Car Visualizer sync logic
  let lastState = 0;
  let lastStopTime = 0;

  const updateVirtualCarLEDs = (hl, state, hz, pk) => {
    const fl = document.getElementById('v-fl');
    const fr = document.getElementById('v-fr');
    const bl = document.getElementById('v-bl');
    const br = document.getElementById('v-br');
    if (!fl || !fr || !bl || !br) return;

    // Track stop transition to determine active braking (2 seconds duration)
    if (state !== lastState) {
      if (lastState !== 0 && state === 0) {
        lastStopTime = Date.now();
      }
      lastState = state;
    }

    const isBraking = (state === 0 && (Date.now() - lastStopTime < 2000) && lastStopTime > 0);

    // Reset classes
    fl.className = 'v-led fl';
    fr.className = 'v-led fr';
    bl.className = 'v-led bl';
    br.className = 'v-led br';

    // Calculate blink state locally (350ms interval)
    const blinkOn = Math.floor(Date.now() / 350) % 2 === 0;

    // 1. Front Headlights
    let flClass = '';
    let frClass = '';
    if (hl === 1) {
      flClass = 'hl-low';
      frClass = 'hl-low';
    } else if (hl === 2) {
      flClass = 'hl-high';
      frClass = 'hl-high';
    } else if (pk && state === 0) {
      flClass = 'park-front';
      frClass = 'park-front';
    }

    // 2. Rear Tail/Brake/Reverse Lights
    let blClass = '';
    let brClass = '';
    if (hl > 0) {
      blClass = 'tail-dim';
      brClass = 'tail-dim';
    }
    if (state === 0) { // stopped/braking
      if (pk) {
        blClass = 'park-rear';
        brClass = 'park-rear';
      } else if (isBraking) {
        blClass = 'tail-brake';
        brClass = 'tail-brake';
      } else {
        blClass = '';
        brClass = '';
      }
    } else if (state === 2 || state === 7 || state === 8) { // reversing
      blClass = 'tail-brake';
      brClass = 'tail-brake';
    }

    if (flClass) fl.classList.add(flClass);
    if (frClass) fr.classList.add(frClass);
    if (blClass) bl.classList.add(blClass);
    if (brClass) br.classList.add(brClass);

    // 3. Blinker / Hazard Overrides
    if (hz) {
      if (blinkOn) {
        fl.className = 'v-led fl park-front';
        fr.className = 'v-led fr park-front';
        bl.className = 'v-led bl park-front';
        br.className = 'v-led br park-front';
      }
    } else {
      // Left Blinker (states: 3, 5, 7)
      if ((state === 3 || state === 5 || state === 7) && blinkOn) {
        fl.className = 'v-led fl park-front';
        bl.className = 'v-led bl park-front';
      }
      // Right Blinker (states: 4, 6, 8)
      if ((state === 4 || state === 6 || state === 8) && blinkOn) {
        fr.className = 'v-led fr park-front';
        br.className = 'v-led br park-front';
      }
    }
  };

  // Run update loop at 30fps
  setInterval(() => {
    if (window._lastTelemetry) {
      const d = window._lastTelemetry;
      updateVirtualCarLEDs(d.hl, d.state, d.hz === 1, d.pk === 1);
    }
  }, 33);
</script>
</body>
</html>
)rawhtml";
  server.send(200, "text/html", page);
}
void handleSetMode() {
  String m = server.arg("mode");
  stopAll();
  strlcpy(rcCmd, "S", sizeof(rcCmd));
  if (m == "rc") {
    carMode = MODE_RC;
    beep(80);
  } else if (m == "gesture") {
    carMode = MODE_GESTURE;
    beep(80);
  } else if (m == "follow") {
    carMode = MODE_FOLLOW;
    beep(80);
  } else {
    carMode = MODE_OA;
    beep(80); delay(80); beep(80);
    rcServoAngle = TURN_ANGLE_C; // Request centering in the main loop thread
  }
  server.send(200, "text/plain", "ok");
}
void handleCmd() {
  String d = server.arg("d");
  strlcpy(rcCmd, d.c_str(), sizeof(rcCmd));
  server.send(200, "text/plain", "ok");
}
void handleHorn() {
  rcHornOn = (server.arg("on") == "1");
  server.send(200, "text/plain", "ok");
}
void handleSpeed() {
  int pct = server.arg("v").toInt();
  pct = constrain(pct, 10, 100);
  rcSpeed = (int)(RC_SPEED_DEF * pct / 100);
  server.send(200, "text/plain", "ok");
}
void handleServo() {
  rcServoAngle = constrain(server.arg("a").toInt(), 0, 180);
  server.send(200, "text/plain", "ok");
}
void handleStatus() {
  String modeStr = "oa";
  if (carMode == MODE_RC) modeStr = "rc";
  else if (carMode == MODE_GESTURE) modeStr = "gesture";
  else if (carMode == MODE_FOLLOW) modeStr = "follow";
  
  String json = "{";
  json += "\"mode\":\"" + modeStr + "\",";
  json += "\"dist\":" + String(lastDistance) + ",";
  json += "\"angle\":" + String(currentServoAngle) + ",";
  json += "\"ir\":" + String(lastIR) + ",";
  json += "\"dL\":" + String(dL_dist) + ",";
  json += "\"dC\":" + String(dC_dist) + ",";
  json += "\"dR\":" + String(dR_dist) + ",";
  json += "\"state\":" + String(carMotionState) + ",";
  json += "\"hl\":" + String(webHeadlightMode) + ",";
  json += "\"hz\":" + String(webHazardsOn ? 1 : 0) + ",";
  json += "\"pk\":" + String(webParkingOn ? 1 : 0);
  json += "}";
  server.send(200, "application/json", json);
}
// ─────────────────────────────────────────────────────────────
//  SETUP
// ─────────────────────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  // Motor pins
  pinMode(L_AIN1, OUTPUT); pinMode(L_AIN2, OUTPUT);
  pinMode(L_BIN1, OUTPUT); pinMode(L_BIN2, OUTPUT);
  pinMode(R_AIN1, OUTPUT); pinMode(R_AIN2, OUTPUT);
  pinMode(R_BIN1, OUTPUT); pinMode(R_BIN2, OUTPUT);
  // LEDC – Setup (Compatible with both Core v2.x and v3.x)
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcAttach(L_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcAttach(L_PWMB, PWM_FREQ, PWM_RES_BITS);
  ledcAttach(R_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcAttach(R_PWMB, PWM_FREQ, PWM_RES_BITS);
#else
  ledcSetup(CH_L_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcSetup(CH_L_PWMB, PWM_FREQ, PWM_RES_BITS);
  ledcSetup(CH_R_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcSetup(CH_R_PWMB, PWM_FREQ, PWM_RES_BITS);
  ledcAttachPin(L_PWMA, CH_L_PWMA);
  ledcAttachPin(L_PWMB, CH_L_PWMB);
  ledcAttachPin(R_PWMA, CH_R_PWMA);
  ledcAttachPin(R_PWMB, CH_R_PWMB);
#endif
  // Standby pin
  pinMode(STBY_PIN, OUTPUT);
  digitalWrite(STBY_PIN, HIGH);
  // Sensors & Horn
  pinMode(TRIG_PIN, OUTPUT);
  pinMode(ECHO_PIN, INPUT);
  pinMode(BUZZER, OUTPUT);
  digitalWrite(BUZZER, LOW);
  // Servo timer allocation to prevent LEDC conflict with motor channels 0-3
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  // NeoPixel Strip Initialization
  strip.begin();
  strip.show();

  // Servo
  scanServo.setPeriodHertz(50);
  scanServo.attach(SERVO_PIN, 500, 2500);
  aimServo(TURN_ANGLE_C, true);
  stopAll();
  // WiFi Setup (Hotspot AP or Station Router mode)
  if (WIFI_AP_MODE) {
    WiFi.softAP(WIFI_SSID, WIFI_PASS);
    Serial.print("Access Point started. IP: ");
    Serial.println(WiFi.softAPIP());
  } else {
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("Connecting to WiFi");
    unsigned long startAttempt = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < 10000) {
      delay(500);
      Serial.print(".");
    }
    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
      Serial.print("Connected to WiFi. IP: ");
      Serial.println(WiFi.localIP());
    } else {
      Serial.println("Connection failed! Defaulting to local AP Mode...");
      WiFi.softAP(FALLBACK_SSID, FALLBACK_PASS);
      Serial.print("Access Point started. IP: ");
      Serial.println(WiFi.softAPIP());
    }
  }

