Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  // Start mDNS Responder (http://ghostdrive.local/)
  if (MDNS.begin("ghostdrive")) {
    Serial.println("mDNS responder started (http://ghostdrive.local/)");
    MDNS.addService("http", "tcp", 80);
  }
  // Web routes
  server.on("/",       handleRoot);
  server.on("/rc",     []() { server.sendHeader("Location", "/"); server.send(302, "text/plain", "Redirecting..."); });
  server.on("/set",    handleSetMode);
  server.on("/cmd",    handleCmd);
  server.on("/horn",   handleHorn);
  server.on("/speed",  handleSpeed);
  server.on("/servo",  handleServo);
  server.on("/status", handleStatus);
  server.onNotFound([]() { server.send(404, "text/plain", "Not Found"); });
  server.begin();
  
  // Start WebSocket Server
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
  
  beep(100);
  Serial.println("System initialized. HTTP & WebSocket servers running.");
}
// ─────────────────────────────────────────────────────────────
//  LOOP
// ─────────────────────────────────────────────────────────────
void loop() {
  server.handleClient();   // Always handle incoming HTTP requests
  webSocket.loop();        // Keep the WebSocket server listening
  updateLEDs();            // Update NeoPixel headlights/brake lights/blinkers
  
  // Update servo angle safely in loop context
  if (carMode == MODE_OA) {
    aimServo(TURN_ANGLE_C, false);
  } else if (carMode == MODE_RC || carMode == MODE_GESTURE) {
    aimServo(rcServoAngle, false);
  }
  
  // Broadcast WebSocket telemetry at 150ms intervals
  static unsigned long lastWsTelemetry = 0;
  if (millis() - lastWsTelemetry > 150) {
    lastWsTelemetry = millis();
    String modeStr = "oa";
    if (carMode == MODE_RC) modeStr = "rc";
    else if (carMode == MODE_GESTURE) modeStr = "gesture";
    else if (carMode == MODE_FOLLOW) modeStr = "follow";
    
    String json = "{";
    json += "\"mode\":\"" + modeStr + "\",";
    json += "\"dist\":" + String(lastDistance) + ",";
    json += "\"angle\":" + String(currentServoAngle) + ",";
    json += "\"ir\":" + String(lastIR) + ",";
    json += "\"dL\":" + String(dL_dist) + ",";
    json += "\"dC\":" + String(dC_dist) + ",";
    json += "\"dR\":" + String(dR_dist) + ",";
    json += "\"state\":" + String(carMotionState) + ",";
    json += "\"hl\":" + String(webHeadlightMode) + ",";
    json += "\"hz\":" + String(webHazardsOn ? 1 : 0) + ",";
    json += "\"pk\":" + String(webParkingOn ? 1 : 0);
    json += "}";
    webSocket.broadcastTXT(json);
  }
  
  if (carMode == MODE_OA) {
    // ── Obstacle Avoidance (Autopilot Mode) ───────────────────
    long dC = distanceCM();
    int ir = analogRead(IR_PIN);
    lastDistance = dC;
    lastIR = ir;
    dC_dist = dC;
    // Edge/cliff protection
    if (ir < IR_THRESHOLD) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delayAndUpdateLEDs(REVERSE_MS);
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delayAndUpdateLEDs(PIVOT_MS); stopAll();
      return;
    }
    // Ultrasonic collision avoidance
    if (dC <= SAFE_DIST_CM) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delayAndUpdateLEDs(REVERSE_MS); stopAll();
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delayAndUpdateLEDs(PIVOT_MS); stopAll();
    } else {
      int spd = (dC >= CLEAR_DIST_CM) ? OA_SPEED : OA_SPEED * 3 / 4;
      forward(spd);
    }
    delay(20);
  } else if (carMode == MODE_RC) {
    // ── RC Web Control Mode ──────────────────────────────────
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    applyRcCmd(rcCmd, rcSpeed);
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL);
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_GESTURE) {
    // ── Gesture Control Mode ─────────────────────────────────
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL);
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_FOLLOW) {
    // ── Human / Hand Following Mode ───────────────────────────
    // Follows hand forward when detected (5-35 cm). Stops when close (< 5 cm) or lost. No reverse. No IR reads.

    unsigned long now = millis();
    static unsigned long lastScanTime = 0;
    static long lastValidDist = 999;

    if (!followFound) {
      // ── Search State (Sweeping) ───────────────────────────
      stopAll();

      // Sweep servo slowly
      followAngle += followSweepDir;
      if (followAngle >= 120) {
        followAngle = 120;
        followSweepDir = -4;
      } else if (followAngle <= 60) {
        followAngle = 60;
        followSweepDir = 4;
      }
      aimServo(followAngle, false);
      currentServoAngle = followAngle;

      // Ping to find targets
      long d = singlePingCM(15000UL);
      lastDistance = d;
      dC_dist = d;

      // Lock on if hand is detected between 5 cm and 35 cm
      if (d >= 5 && d <= 35) {
        followFound = true;
        lostFollowTime = now;
        lastValidDist = d;
        lastScanTime = 0; // reset scan cooldown
        beep(70); // Lock feedback
      }
      delayAndUpdateLEDs(60);
    } else {
      // ── Locked Tracking State (Quiet search-on-loss with 600ms Cooldown) ──
      // Servo points straight at followAngle. No wiggling if hand is steady!
      aimServo(followAngle, false);
      currentServoAngle = followAngle;
      
      long d = singlePingCM(12000UL);
      dC_dist = d;

      if (d >= 5 && d <= 35) {
        // Hand is still directly in front of the servo!
        lostFollowTime = now;
        lastValidDist = d;
        lastDistance = d;
        dL_dist = 999;
        dR_dist = 999;

        // Drive to maintain 7cm distance (stops if < 5cm, no reverse)
        if (d < 5) {
          stopAll();
        } else {
          if (followAngle > 105) {
            pivotLeft(OA_TURN * 6 / 10);  // slow left turn
          } else if (followAngle < 75) {
            pivotRight(OA_TURN * 6 / 10); // slow right turn
          } else {
            forward(OA_SPEED * 6 / 10);   // drive straight forward
          }
        }
      } else {
        // Center reading is lost! Stop motors.
        stopAll();

        // Scan left/right ONLY once every 600ms to prevent vibration
        if (now - lastScanTime > 600) {
          lastScanTime = now;

          // Scan Left
          int angleL = constrain(followAngle + 18, 45, 135);
          aimServo(angleL, false);
          delayAndUpdateLEDs(80); // allow servo to settle
          long dL_s = singlePingCM(12000UL);
          dL_dist = dL_s;

          // Scan Right
          int angleR = constrain(followAngle - 18, 45, 135);
          aimServo(angleR, false);
          delayAndUpdateLEDs(80); // allow servo to settle
          long dR_s = singlePingCM(12000UL);
          dR_dist = dR_s;

          // Restore center servo position
          aimServo(followAngle, false);

          if (dL_s >= 5 && dL_s <= 35 && (dR_s > dL_s || dR_s > 35)) {
            // Hand is on the left
            followAngle = constrain(followAngle + 15, 60, 120);
            lostFollowTime = now;
            lastValidDist = dL_s;
          } else if (dR_s >= 5 && dR_s <= 35 && (dL_s > dR_s || dL_s > 35)) {
            // Hand is on the right
            followAngle = constrain(followAngle - 15, 60, 120);
            lostFollowTime = now;
            lastValidDist = dR_s;
          }
        }

        // If target lost for more than 1500 ms, break lock
        if (now - lostFollowTime > 1500) {
          followFound = false;
          beep(50);
          delayAndUpdateLEDs(50);
          beep(50);
        }
      }
      delayAndUpdateLEDs(40); // 25Hz loop
    }
  }
}
